Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1170/periph/PERI_OCOTP.h
#define OCOTP_OUT_STATUS_TOG_DED2_MASK           (0x4000000U)
#define OCOTP_OUT_STATUS_TOG_DED2_SHIFT          (26U)
/*! DED2 - Double error detect */
#define OCOTP_OUT_STATUS_TOG_DED2(x)             (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_TOG_DED2_SHIFT)) & OCOTP_OUT_STATUS_TOG_DED2_MASK)

#define OCOTP_OUT_STATUS_TOG_DED3_MASK           (0x8000000U)
#define OCOTP_OUT_STATUS_TOG_DED3_SHIFT          (27U)
/*! DED3 - Double error detect */
#define OCOTP_OUT_STATUS_TOG_DED3(x)             (((uint32_t)(((uint32_t)(x)) << OCOTP_OUT_STATUS_TOG_DED3_SHIFT)) & OCOTP_OUT_STATUS_TOG_DED3_MASK)
/*! @} */

/*! @name VERSION - OTP Controller Version Register */
/*! @{ */

#define OCOTP_VERSION_STEP_MASK                  (0xFFFFU)
#define OCOTP_VERSION_STEP_SHIFT                 (0U)
/*! STEP - RTL Version Stepping */
#define OCOTP_VERSION_STEP(x)                    (((uint32_t)(((uint32_t)(x)) << OCOTP_VERSION_STEP_SHIFT)) & OCOTP_VERSION_STEP_MASK)

#define OCOTP_VERSION_MINOR_MASK                 (0xFF0000U)
#define OCOTP_VERSION_MINOR_SHIFT                (16U)
/*! MINOR - Minor RTL Version */
#define OCOTP_VERSION_MINOR(x)                   (((uint32_t)(((uint32_t)(x)) << OCOTP_VERSION_MINOR_SHIFT)) & OCOTP_VERSION_MINOR_MASK)

#define OCOTP_VERSION_MAJOR_MASK                 (0xFF000000U)
#define OCOTP_VERSION_MAJOR_SHIFT                (24U)
/*! MAJOR - Major RTL Version */
#define OCOTP_VERSION_MAJOR(x)                   (((uint32_t)(((uint32_t)(x)) << OCOTP_VERSION_MAJOR_SHIFT)) & OCOTP_VERSION_MAJOR_MASK)
/*! @} */

/*! @name READ_FUSE_DATA - OTP Controller Read Data 0 Register..OTP Controller Read Data 3 Register */
/*! @{ */

#define OCOTP_READ_FUSE_DATA_DATA_MASK           (0xFFFFFFFFU)
#define OCOTP_READ_FUSE_DATA_DATA_SHIFT          (0U)
/*! DATA - Data */
#define OCOTP_READ_FUSE_DATA_DATA(x)             (((uint32_t)(((uint32_t)(x)) << OCOTP_READ_FUSE_DATA_DATA_SHIFT)) & OCOTP_READ_FUSE_DATA_DATA_MASK)
/*! @} */

/* The count of OCOTP_READ_FUSE_DATA */
#define OCOTP_READ_FUSE_DATA_COUNT               (4U)

/*! @name SW_LOCK - SW_LOCK Register */
/*! @{ */

#define OCOTP_SW_LOCK_SW_LOCK_MASK               (0xFFFFFFFFU)
#define OCOTP_SW_LOCK_SW_LOCK_SHIFT              (0U)
#define OCOTP_SW_LOCK_SW_LOCK(x)                 (((uint32_t)(((uint32_t)(x)) << OCOTP_SW_LOCK_SW_LOCK_SHIFT)) & OCOTP_SW_LOCK_SW_LOCK_MASK)
/*! @} */

/*! @name BIT_LOCK - BIT_LOCK Register */
/*! @{ */

#define OCOTP_BIT_LOCK_BIT_LOCK_MASK             (0xFFFFFFFFU)
#define OCOTP_BIT_LOCK_BIT_LOCK_SHIFT            (0U)
#define OCOTP_BIT_LOCK_BIT_LOCK(x)               (((uint32_t)(((uint32_t)(x)) << OCOTP_BIT_LOCK_BIT_LOCK_SHIFT)) & OCOTP_BIT_LOCK_BIT_LOCK_MASK)
/*! @} */

/*! @name LOCKED0 - OTP Controller Program Locked Status 0 Register */
/*! @{ */

#define OCOTP_LOCKED0_LOCKED_MASK                (0xFFFFU)
#define OCOTP_LOCKED0_LOCKED_SHIFT               (0U)
#define OCOTP_LOCKED0_LOCKED(x)                  (((uint32_t)(((uint32_t)(x)) << OCOTP_LOCKED0_LOCKED_SHIFT)) & OCOTP_LOCKED0_LOCKED_MASK)
/*! @} */

/*! @name LOCKED1 - OTP Controller Program Locked Status 1 Register */
/*! @{ */

#define OCOTP_LOCKED1_LOCKED_MASK                (0xFFFFFFFFU)
#define OCOTP_LOCKED1_LOCKED_SHIFT               (0U)
#define OCOTP_LOCKED1_LOCKED(x)                  (((uint32_t)(((uint32_t)(x)) << OCOTP_LOCKED1_LOCKED_SHIFT)) & OCOTP_LOCKED1_LOCKED_MASK)
/*! @} */

/*! @name FUSE - Value of fuse word 0..Value of fuse word 143 */
/*! @{ */

#define OCOTP_FUSE_BITS_MASK                     (0xFFFFFFFFU)
#define OCOTP_FUSE_BITS_SHIFT                    (0U)
/*! BITS - Reflects value of the fuse word */
#define OCOTP_FUSE_BITS(x)                       (((uint32_t)(((uint32_t)(x)) << OCOTP_FUSE_BITS_SHIFT)) & OCOTP_FUSE_BITS_MASK)
/*! @} */

/* The count of OCOTP_FUSE */
#define OCOTP_FUSE_COUNT                         (144U)


/*!
 * @}
 */ /* end of group OCOTP_Register_Masks */


/*!
 * @}
 */ /* end of group OCOTP_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_OCOTP_H_ */

